/**
 * [mocks]
 * @param  {[type]} app [description]
 * @return {[type]}     [description]
 */

var Mock = require('mockjs');

var MockData = Mock.mock( 'Event/ListDealData' , {
        "returnCode": "200",
        "list": [
            {
                "id": "16091409280610027347",
                "content": "退回测试版型男人味",
                "createTime": "2016-09-14 17:27:40",
                "title": "我要退回",
                "status": "6",
                "userId": "16050516311810006139",
                "categoryId": "16091409090610027322",
                "addr": "",
                "spId": "16050516421010006209",
                "coordinates": "",
                "recordStatus": "1"
            },
            {
                "id": "16091409175910027331",
                "content": "民生社区有只流浪狗有人收养吗",
                "createTime": "2016-09-14 17:17:33",
                "title": "我测一下就出来",
                "status": "4",
                "userId": "16050516311810006139",
                "categoryId": "16091409090610027322",
                "addr": "中国上海市浦东新区博霞路50号",
                "spId": "16050516421010006209",
                "coordinates": "{\"name\":\"中国上海市浦东新区博霞路50号\",\"x\":\"121.59882089418096\",\"y\":\"31.201975353389084\"}",
                "recordStatus": "1"
            },
            {
                "id": "16091407123910027050",
                "content": "挤了挤了头了图您同事复古了调配咯",
                "createTime": "2016-09-14 15:12:13",
                "title": "测试处理",
                "status": "2",
                "userId": "16050516311810006139",
                "categoryId": "16090906421210024100",
                "addr": "中国上海市浦东新区博霞路50号",
                "spId": "16050516421010006209",
                "coordinates": "{\"name\":\"中国上海市浦东新区博霞路50号\",\"x\":\"121.59880092947049\",\"y\":\"31.202013033667207\"}",
                "recordStatus": "1"
            },
            {
                "id": "16091403160010026869",
                "content": "台式机了挤",
                "createTime": "2016-09-14 11:15:34",
                "title": "再次测试推送",
                "status": "4",
                "userId": "16050516311810006139",
                "categoryId": "16090906421210024100",
                "addr": "中国上海市浦东新区博霞路50号",
                "spId": "16050516421010006209",
                "coordinates": "{\"name\":\"中国上海市浦东新区博霞路50号\",\"x\":\"121.5988079047016\",\"y\":\"31.202011137140264\"}",
                "recordStatus": "1"
            },
            {
                "id": "16091403003310026855",
                "content": "哈哈哈",
                "createTime": "2016-09-14 11:00:07",
                "title": "测试事件发送测试事件发送测试事件发送测试事件发送",
                "status": "3",
                "userId": "16050516311810006139",
                "categoryId": "16090906421210024100",
                "addr": "中国上海市浦东新区博霞路50号",
                "spId": "16050516421010006209",
                "coordinates": "{\"name\":\"中国上海市浦东新区博霞路50号\",\"x\":\"121.59879397841101\",\"y\":\"31.20199294663233\"}",
                "recordStatus": "1"
            }
        ],
        "dataCount": 5,
        "returnType": "0",
        "ct": 1474265250381
    }
);

module.exports = MockData;


